#Пользователь вводит строку. Определите, есть ли в ней буква а.
# a = "a"
# stroka = input()
# for i in stroka:
#     if a in stroka:
#         print(True)
#     else:
#         print(False)


#Пользователь вводит строку. Выведите индекс первого вхождения буквы о.
# Если буквы о нет, выведите сообщение об этом.
# text = input()
# if "о" in text:
#     print(text.index("о"))
# else:
#     print("нет буквы о")

#Приведите строку к виду с заглавной первой буквой.
# s = "пончик"
# a = s.title()
# v = s[0].upper() + s[1:]
# print(v)

# Преобразуйте строку к верхнему и нижнему регистру.
# s = "ПоНчИк"
# print(s.upper())
# print(s.lower())

#Пользователь вводит строку. Определите, оканчивается ли строка на "ов".

# s = input()
# if s[-2:] == "ов":
#     print(True)
# else:
#     print(False)


#Пользователь вводит строку. Определите, состоит ли она только из букв.
# s = input()
# if s.isalpha():
#     print("строка состоит только из букв")
# else:
#     print("строка не состоит только из букв")

#Пользователь вводит строку. Определите, содержит ли она хотя бы одну цифру.
# s = input()
# if s.isdigit():
#     print("строка состоит только из чисел")
# else:
#     print("строка не состоит только из чисел")



